import { v4 } from 'uuid';

export const GuaranteeRules=[
    {
        id: v4(),
        rule: 'При підборі деталі за каталогом було допущено помилку (установка деталі проводилася на невідповідний автомобіль);',
        ruleEN: 'Article',
      },
      {
        id: v4(),
        rule: 'Деталь була деформована під час встановлення/зняття;',
        ruleEN: 'Title'
      },
      {
        id: v4(),
        rule: 'Деталь була встановлена з порушенням правил її встановлення, що призвело до її несправності;',
        ruleEN: 'Side'
      },
      {
        id: v4(),
        rule: 'Деталь має видимі пошкодження, які були викликані її використанням та експлуатацією;',
        ruleEN: 'Brand'
      },
      {
        id: v4(),
        rule: 'Конструкція деталі була змінена у процесі її монтажу на транспортний засіб;',
        ruleEN: 'Car brand'
      },
      {
        id: v4(),
        rule: 'Деталь втратила свої корисні властивості через знос;',
        ruleEN: 'Model',
      },
      {
        id: v4(),
        rule: 'Комплектація деталі не відповідає тій, яка була в момент її придбання в магазині;',
        ruleEN: 'Bodies',
      },
      {
        id: v4(),
        rule: 'Деталь експлуатувалася в екстремальних умовах (спортивні заходи);',
        ruleEN: 'Installed From - Until',
      }
]

export const DocumentsForGuarantee=[
    {
        id: v4(),
        dokument: 'Гарантійний талон (якщо передбачений заводом-виробником) з печаткою продавця;',
        dokumentEN: 'Article',
      },
      {
        id: v4(),
        dokument: "Ксерокопію наряд-замовлення із СТО, яке проводило процедуру встановлення та зняття деталі з транспортного засобу. Цей документ повинен включати повну інформацію про СТО та автомобіль, а також перелік усіх виконаних операцій. Обов'язково перевірте, щоб документ був із печаткою, якщо ж його немає, то потрібна буде копія витягу з держреєстру про реєстрацію; Копію чека, рахунок-фактури чи накладної;",
        dokumentEN: 'Title'
      },
      {
        id: v4(),
        dokument: 'Акт рекламації (можна завантажити із нашого сайту). Цей документ має бути заповнений на СТО. У ньому детально має бути описано суть проблеми, наведено інформацію про стан інших деталей автомобіля та загальні дані про сам транспортний засіб. Акт має бути засвідчений печаткою або йти разом із копією виписки з держ.реєстру про реєстрацію (якщо СТО працює без друку);',
        dokumentEN: 'Side'
      },
      {
        id: v4(),
        dokument: 'Висновок про проведення діагностики несправності (тільки для елементів електрообладнання, вартість яких перевищує 200 гривень з ПДВ).',
        dokumentEN: 'Brand'
      }
]